
import Model from '../model';

const stages = [
    "المرحلة الاولى",
    "المرحلة الثانية",
    "المرحلة الثالثة",
]
const books = [
    [
        {
            title: "المسائل المنتخبة",
            details: "يعدّ الكتاب دليلاً عملياً ومرجعاً سريعاً للمسائل الفقهية ، مرتبة على أبواب الفقه التقليدية. هو بمثابة مختصر للرسالة العملية (المنهاج الصالح) للسيّد السيستاني، يركز على الجانب التطبيقي.",
            link: "https://drive.google.com/file/d/1n5T6Yh1yf_iZS-0fdXHafjd_pEnbrLD8/view?usp=sharing"
        },
        {
            title: " دروس منهجية في شرح عقائد الامامية الجزء الاول ",
            details: "يُعد هذا الكتاب شرحاً تعليمياً منهجياً لكتاب عقائد الإمامية للشيخ محمد رضا المظفر، وهو أحد أهم المتون الحديثة التي تلخص عقائد الشيعة الإثني عشرية. يتميز الشرح بأسلوب دراسي مبسط ومفصل يناسب طلبة العلوم الدينية والمثقفين.",
            link: "https://drive.google.com/file/d/1HKG_vQqUl1QUNQgQWsGuVqzcyTN3IWK8/view?usp=sharing"
        },
        {
            title: " دروس منهجية في شرح عقائد الامامية الجزء الثاني ",
            details: "يُعد هذا الكتاب شرحاً تعليمياً منهجياً لكتاب عقائد الإمامية للشيخ محمد رضا المظفر، وهو أحد أهم المتون الحديثة التي تلخص عقائد الشيعة الإثني عشرية. يتميز الشرح بأسلوب دراسي مبسط ومفصل يناسب طلبة العلوم الدينية والمثقفين.",
            link: "https://drive.google.com/file/d/1sTxidyhEnnhJPMV9TpFEHmsFchfqZTjD/view?usp=sharing"
        },
        {
            title: " دروس منهجية في شرح عقائد الامامية الجزء الثالث ",
            details: "يُعد هذا الكتاب شرحاً تعليمياً منهجياً لكتاب عقائد الإمامية للشيخ محمد رضا المظفر، وهو أحد أهم المتون الحديثة التي تلخص عقائد الشيعة الإثني عشرية. يتميز الشرح بأسلوب دراسي مبسط ومفصل يناسب طلبة العلوم الدينية والمثقفين.",
            link: "https://drive.google.com/file/d/1nFcyBpQAQ75z4gGJK-jv__vA68s99IqR/view?usp=sharing"

        },
        {
            title: "المنطق للمظفر",
            details: 'كتاب "المنطق" للشيخ محمد رضا المظفر هو عمل منهجي ومهم في علم المنطق، يُستخدم كمرجع أساسي لتدريس هذا العلم في الحوزات العلمية والجامعات. يهدف الكتاب إلى تعليم القواعد والمبادئ الأساسية للتفكير السليم وحماية الذهن من الخطأ في الفكر. ',
            link: "https://drive.google.com/file/d/1nFcyBpQAQ75z4gGJK-jv__vA68s99IqR/view?usp=sharing"
        },
        {
            title: "شرح قطر الندى وبل الصدى",
            details: 'يُعد الكتاب مرحلة "متوسطة" أو "تأسيسية متقدمة" في دراسة النحو. فهو مصمم للطالب الذي أتقن المبادئ الأساسية (كقواعد "الآجرومية")، ويرغب في التوسع والانتقال إلى مستوى أكثر عمقاً ودقة قبل دراسة مطولات النحو كـ "ألفية ابن مالك". يهدف إلى تأسيس القواعد النحوية الراسخة لدى المتعلم.',
            link: "https://drive.google.com/file/d/1f8XMfaSRJoAlgUuE7ZE47JAz29QENOiz/view?usp=sharing"
        },
        {
            title: "محاضرات من وحي الخيال",
            details: "يقدم الكتاب منهجاً تربوياً وأخلاقياً متكاملاً يستند إلى القرآن الكريم وروايات أهل البيت (عليهم السلام). هو عبارة عن سلسلة من القواعد (30 قاعدة) تهدف إلى بناء الشخصية المؤمنة وسيرها في طريق التكامل الروحي. لا يكتفي الكتاب بالسرد النظري للفضائل، بل يغوص في العمق التحليلي للنفس البشرية وعلاقتها بالخالق وبالآخرين.",
            link: "https://drive.google.com/file/d/1TEvlzXZqhGpdjH1hR9ayiORtXBSDgNtK/view?usp=sharing"
        },
        {
            title: "تفسير سورة المزمل والحجرات والنور والحاقة",
            details: "الكتاب هو الجزء الرابع عشر من تفسير الأمثل في تفسير كتاب الله المنزل، ويتناول تفسير مجموعة من السور القرآنية بأسلوب تربوي واجتماعي حديث",
            link: "https://drive.google.com/file/d/1s68cqT_kpLkymDZ8OU8wkL0q4hySTlPs/view?usp=sharing"
        },

    ],
    [
        {
            title: "المسائل المنتخبة",
            details: "يعدّ الكتاب دليلاً عملياً ومرجعاً سريعاً للمسائل الفقهية ، مرتبة على أبواب الفقه التقليدية. هو بمثابة مختصر للرسالة العملية (المنهاج الصالح) للسيّد السيستاني، يركز على الجانب التطبيقي.",
            link: "https://drive.google.com/file/d/1n5T6Yh1yf_iZS-0fdXHafjd_pEnbrLD8/view?usp=sharing"
        },
        {
            title: "الباب الحادي عشر",
            details: "رحلة في أصول العقائد الإسلامية. متن العلامة الحلي وشرح الفاضل المقداد، يجمع بين دقة الاستدلال العقلي ووضوح الشرح. الكتاب الأساس لكل باحث عن معرفة الله وصفاته والنبوات وفق منهج علمي رصين.",
            link: "https://drive.google.com/file/d/1ajJRecNoJHwqYahYNYO_RCeHn85Nshhu/view?usp=sharing"
        },

        {
            title: "المنطق للمظفر",
            details: 'كتاب "المنطق" للشيخ محمد رضا المظفر هو عمل منهجي ومهم في علم المنطق، يُستخدم كمرجع أساسي لتدريس هذا العلم في الحوزات العلمية والجامعات. يهدف الكتاب إلى تعليم القواعد والمبادئ الأساسية للتفكير السليم وحماية الذهن من الخطأ في الفكر. ',
            link: "https://drive.google.com/file/d/1nFcyBpQAQ75z4gGJK-jv__vA68s99IqR/view?usp=sharing"
        },
        {
            title: "شرح قطر الندى وبل الصدى",
            details: 'يُعد الكتاب مرحلة "متوسطة" أو "تأسيسية متقدمة" في دراسة النحو. فهو مصمم للطالب الذي أتقن المبادئ الأساسية (كقواعد "الآجرومية")، ويرغب في التوسع والانتقال إلى مستوى أكثر عمقاً ودقة قبل دراسة مطولات النحو كـ "ألفية ابن مالك". يهدف إلى تأسيس القواعد النحوية الراسخة لدى المتعلم.',
            link: "https://drive.google.com/file/d/1f8XMfaSRJoAlgUuE7ZE47JAz29QENOiz/view?usp=sharing"
        }
        ,
        {
            title: "دروس تربوية في كتاب آداب المتعلمين",
            details: "كتاب (دروس تربوية في كتاب آداب المتعلمين)؛ هو دليل منهجي وأخلاقي يهدف إلى بناء شخصية طالب العلم وفق مدرسة أهل البيت (ع). يستعرض الكتاب بشرح ميسّر وصايا المحقق الخواجة نصير الدين الطوسي، مركزاً على أهمية النية الخالصة، والصبر على مشاق التحصيل، وكيفية اختيار العلوم النافعة التي تجمع بين صلاح الدنيا والفوز في الآخرة. يُعد الكتاب مرجعاً تربوياً لا غنى عنه لكل باحث عن السلوك القويم في رحلة طلب العلم",
            link: "https://drive.google.com/file/d/1CbdRS-CKI13fUcMQc7sfpmkulCtRgf08/view?usp=sharing"
        },
        {
            title: "البيان في تفسير القرآن للسيد الخوئي(قد)",
            details: "يعتبر كتاب البيان في تفسير القرآن للسيد أبو القاسم الخوئي من أهم وأبرز المصادر العلمية الحديثة التي تناولت علوم القرآن بمنهجية استدلالية رصينة تجمع بين الدقة الأصولية والعمق التفسيري. لا يقتصر الكتاب على كونه تفسيراً تقليدياً، بل يمثل موسوعة تأسيسية في علوم القرآن ناقش فيها المؤلف قضايا جوهرية مثل إعجاز القرآن وصيانته من التحريف بأسلوب علمي رصين يفند الشبهات بالدليل والبرهان. كما يتوسع الكتاب في دراسة مباحث النسخ والقراءات وحجية ظواهر الكتاب الكريم، مختتماً هذه الدراسات التمهيدية بتفسير نموذجي عميق لسورة الفاتحة يعكس منهجية المؤلف في استنطاق النص القرآني واستنباط معانيه، مما جعله مرجعاً أساسياً لا يستغني عنه الباحثون وطلاب العلوم الإسلامية في العصر الراهن.",
            link: "https://drive.google.com/file/d/1NVgdSJ4LZpQc90CVey73esKNPROUftub/view?usp=sharing"
        }
    ]
    ,

    [
        {
            title: "محاضرات في الالهيات",
            details: "يُعد هذا الكتاب أحد أبرز الركائز المعاصرة في دراسة علم الكلام والعقيدة الإسلامية وفق مدرسة أهل البيت (عليهم السلام). يتميز بكونه صياغة حديثة ومهذبة للمسائل العقائدية الكبرى، حيث يجمع بين عمق البرهان العقلي وسلاسة البيان القرآني، مما يجعله المرجع المفضل لطلاب العلم والباحثين في أصول الدين",
            link: "https://drive.google.com/file/d/1EqPNZZ7A5f8PChAYjgsYqIJTVLt1iKjD/view?usp=sharing"

        },
        {
            title: "مائة قاعدة فقهية",
            details: `يُعدّ كتاب «مائة قاعدة فقهية» مرجعًا تخصصيًا مهمًا لطلبة العلوم الدينية والباحثين في الفقه وأصول الاستنباط، إذ يمثّل خلاصة جهدٍ علميٍّ رصين استمرّ أكثر من عشر سنوات، خُصّص لتدوين القواعد الفقهية التي تُشكّل الأساس في استنباط الأحكام الشرعية.
يمتاز الكتاب بمنهجيته الواضحة التي تجمع بين دقّة العبارة وسهولة العرض، حيث رتّب المؤلّف القواعد ترتيبًا هجائيًا من الألف إلى الياء، مع الاستدلال عليها بالأدلة المعتبرة من الكتاب والسنة والإجماع والعقل، مما يجعله أداة عملية نافعة في الدراسة والتطبيق الفقهي.`,
            link: "https://drive.google.com/file/d/13qTng4s9Z5uLz91M1r_lCVc0HVUd5AGz/view?usp=sharing"
        },
        {
            title: "شرح قطر الندى وبل الصدى",
            details: 'يُعد الكتاب مرحلة "متوسطة" أو "تأسيسية متقدمة" في دراسة النحو. فهو مصمم للطالب الذي أتقن المبادئ الأساسية (كقواعد "الآجرومية")، ويرغب في التوسع والانتقال إلى مستوى أكثر عمقاً ودقة قبل دراسة مطولات النحو كـ "ألفية ابن مالك". يهدف إلى تأسيس القواعد النحوية الراسخة لدى المتعلم.',
            link: "https://drive.google.com/file/d/1f8XMfaSRJoAlgUuE7ZE47JAz29QENOiz/view?usp=sharing"
        },
        {
            title: "المنطق للمظفر",
            details: 'كتاب "المنطق" للشيخ محمد رضا المظفر هو عمل منهجي ومهم في علم المنطق، يُستخدم كمرجع أساسي لتدريس هذا العلم في الحوزات العلمية والجامعات. يهدف الكتاب إلى تعليم القواعد والمبادئ الأساسية للتفكير السليم وحماية الذهن من الخطأ في الفكر. ',
            link: "https://drive.google.com/file/d/1nFcyBpQAQ75z4gGJK-jv__vA68s99IqR/view?usp=sharing"
        },
        {
            title: "من وحي الاخلاق",
            details: `كتاب «من وحي الأخلاق (المجموعة الثانية)» للشيخ حسين عبد الرضا الأسدي، الحلقة الرابعة من سلسلة لنكن لهم زينًا، يقدّم ثلاثين قاعدة أخلاقية عملية لبناء الإنسان، تركّز على تزكية النفس، مركزية النية، وقوة الإرادة، بأسلوب واضح مدعوم بالقرآن وروايات أهل البيت (عليهم السلام) وقصص تربوية هادفة.`,
            link: "https://drive.google.com/file/d/1TLUdIsoxncAmXofk3mG9KoX_lF9nAc3n/view?usp=sharing"
        },
        
        {
            title: "البيان في تفسير القرآن للسيد الخوئي(قد)",
            details: "يعتبر كتاب البيان في تفسير القرآن للسيد أبو القاسم الخوئي من أهم وأبرز المصادر العلمية الحديثة التي تناولت علوم القرآن بمنهجية استدلالية رصينة تجمع بين الدقة الأصولية والعمق التفسيري. لا يقتصر الكتاب على كونه تفسيراً تقليدياً، بل يمثل موسوعة تأسيسية في علوم القرآن ناقش فيها المؤلف قضايا جوهرية مثل إعجاز القرآن وصيانته من التحريف بأسلوب علمي رصين يفند الشبهات بالدليل والبرهان. كما يتوسع الكتاب في دراسة مباحث النسخ والقراءات وحجية ظواهر الكتاب الكريم، مختتماً هذه الدراسات التمهيدية بتفسير نموذجي عميق لسورة الفاتحة يعكس منهجية المؤلف في استنطاق النص القرآني واستنباط معانيه، مما جعله مرجعاً أساسياً لا يستغني عنه الباحثون وطلاب العلوم الإسلامية في العصر الراهن.",
            link: "https://drive.google.com/file/d/1NVgdSJ4LZpQc90CVey73esKNPROUftub/view?usp=sharing"
        }
    ]
]
const Almuqadimat = () => {

    return (

        <Model title={"المقدمات"} stages={stages} books={books} />
    )
}





export default Almuqadimat